In [1]:
import pandas as pd   # 책에 포함되는 코드는 아닙니다

In [2]:
class Student:
    def __init__(self, a, b, c, d):
        self.name=a   # 이름
        self.age=b    # 나이
        self.univ=c   # 학교명
        self.job=d    # 희망진로
        
    def show(self):
        print(self.name, self.age, self.univ, self.job)

In [3]:
h=Student('홍길동', 21, '한국대학교', 'SW 개발자')

In [4]:
h.show()

홍길동 21 한국대학교 SW 개발자

In [5]:
j=Student('장희원', 19, '한국대학교', 'SW 아키텍터')

In [6]:
j.name

'장희원'

In [7]:
df=pd.DataFrame(columns=['국어', '수학', '영어'])

In [8]:
df

Empty DataFrame
Columns: [국어, 수학, 영어]
Index: []

In [9]:
df.loc['홍길동']=[90, 85, 95]

In [10]:
df

     국어  수학  영어
홍길동  90  85  95

In [11]:
df.loc['장희원']=[85, 85, 100]    # 책에 포함되는 코드는 아닙니다
df.loc['김보라']=[80, 80, 75]
df.loc['최하늘']=[90, 80, 85]

In [12]:
df

     국어  수학   영어
홍길동  90  85   95
장희원  85  85  100
김보라  80  80   75
최하늘  90  80   85

In [13]:
df.loc['홍길동']

국어    90
수학    85
영어    95
Name: 홍길동, dtype: object

In [14]:
df.loc['홍길동', '수학']

85

In [15]:
df.loc[:, '수학']

홍길동    85
장희원    85
김보라    80
최하늘    80
Name: 수학, dtype: object

In [16]:
df.loc['홍길동', :]

국어    90
수학    85
영어    95
Name: 홍길동, dtype: object

In [17]:
x=df.loc[['홍길동','최하늘'], ['국어','영어']]

In [18]:
x

     국어  영어
홍길동  90  95
최하늘  90  85

In [19]:
df=pd.read_excel('sample1.xlsx')

In [20]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\pydev\lib\site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in c:\pydev\lib\site-packages (from openpyxl) (1.1.0)

In [21]:
df=pd.read_excel('sample1.xlsx')

In [22]:
df

    이름  국어  수학   영어
0  홍길동  90  85   90
1  장희원  85  85  100
2  김보라  80  80   75
3  최하늘  90  80   85

In [23]:
df2=pd.read_csv('sample.csv', encoding='cp949')

In [24]:
df=pd.read_excel('sample1.xlsx', header=None)

In [25]:
df3=pd.read_excel('sample3.xlsx', sheet_name='오늘')

In [26]:
df=pd.read_excel('sample1.xlsx')

In [27]:
df

    이름  국어  수학   영어
0  홍길동  90  85   90
1  장희원  85  85  100
2  김보라  80  80   75
3  최하늘  90  80   85

In [28]:
df.shape

(4, 4)

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
df.columns

Index(['이름', '국어', '수학', '영어'], dtype='object')

In [31]:
df.head(2)

    이름  국어  수학   영어
0  홍길동  90  85   90
1  장희원  85  85  100

In [32]:
df.tail(2)

    이름  국어  수학  영어
2  김보라  80  80  75
3  최하늘  90  80  85

In [33]:
df.describe()

              국어         수학         영어
count   4.000000   4.000000    4.00000
mean   86.250000  82.500000   87.50000
std     4.787136   2.886751   10.40833
min    80.000000  80.000000   75.00000
25%    83.750000  80.000000   82.50000
50%    87.500000  82.500000   87.50000
75%    90.000000  85.000000   92.50000
max    90.000000  85.000000  100.00000

In [34]:
s=df['국어']+df['수학']

In [35]:
print(s)

0    175
1    170
2    160
3    170
dtype: int64

In [36]:
s=df.loc[0, ['국어','수학','영어']]+df.loc[1,
                                    ['국어','수학','영어']]

In [37]:
s

국어    175
수학    170
영어    190
dtype: object

In [38]:
df.sum()

이름    홍길동장희원김보라최하늘
국어             345
수학             330
영어             350
dtype: object

In [39]:
df.sum(axis=1)

C:\Users\mkjang\AppData\Local\Temp/ipykernel_4620/1459321664.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

0    265
1    270
2    235
3    255
dtype: int64

In [40]:
df['합계']=df[['국어','수학','영어']].sum(axis=1)

In [41]:
df

    이름  국어  수학   영어   합계
0  홍길동  90  85   90  265
1  장희원  85  85  100  270
2  김보라  80  80   75  235
3  최하늘  90  80   85  255

In [42]:
df['평균']=round(df['합계']/3, 1)

In [43]:
df

    이름  국어  수학   영어   합계    평균
0  홍길동  90  85   90  265  88.3
1  장희원  85  85  100  270  90.0
2  김보라  80  80   75  235  78.3
3  최하늘  90  80   85  255  85.0

In [44]:
df.loc['과목평균']=['',
                df['국어'].sum()/len(df),
                df['수학'].sum()/len(df),
                df['영어'].sum()/len(df),
                '', '']

In [45]:
df

       이름     국어    수학     영어   합계    평균
0     홍길동  90.00  85.0   90.0  265  88.3
1     장희원  85.00  85.0  100.0  270  90.0
2     김보라  80.00  80.0   75.0  235  78.3
3     최하늘  90.00  80.0   85.0  255  85.0
과목평균       86.25  82.5   87.5

In [46]:
df1=df.drop('이름', axis='columns')

In [47]:
df1

         국어    수학     영어   합계    평균
0     90.00  85.0   90.0  265  88.3
1     85.00  85.0  100.0  270  90.0
2     80.00  80.0   75.0  235  78.3
3     90.00  80.0   85.0  255  85.0
과목평균  86.25  82.5   87.5

In [48]:
df.drop(2, axis=0)

       이름     국어    수학     영어   합계    평균
0     홍길동  90.00  85.0   90.0  265  88.3
1     장희원  85.00  85.0  100.0  270  90.0
3     최하늘  90.00  80.0   85.0  255  85.0
과목평균       86.25  82.5   87.5

In [49]:
df=pd.read_excel('sample1.xlsx')  # 책에 포함되는 코드는 아닙니다

In [50]:
df.query('영어>80')

    이름  국어  수학   영어
0  홍길동  90  85   90
1  장희원  85  85  100
3  최하늘  90  80   85

In [51]:
cut=90
df.query('영어>@cut')

    이름  국어  수학   영어
1  장희원  85  85  100

In [52]:
cut=90
df.query('not(영어>@cut)')

    이름  국어  수학  영어
0  홍길동  90  85  90
2  김보라  80  80  75
3  최하늘  90  80  85

In [53]:
df.query('이름=="홍길동"')

    이름  국어  수학  영어
0  홍길동  90  85  90

In [54]:
df.query('국어>85 and 영어>85')

    이름  국어  수학  영어
0  홍길동  90  85  90

In [55]:
df.query('이름 in ["홍길동", "최하늘"]')

    이름  국어  수학  영어
0  홍길동  90  85  90
3  최하늘  90  80  85

In [56]:
df=pd.read_excel('sample2.xlsx')  # 책에 포함되는 코드는 아닙니다

In [57]:
df

    이름  국어  수학   영어  총 합계
0  홍길동  90  85   90   265
1  장희원  85  85  100   270
2  김보라  80  80   75   235
3  최하늘  90  80   85   255

In [58]:
df.query('`총 합계`>260')

    이름  국어  수학   영어  총 합계
0  홍길동  90  85   90   265
1  장희원  85  85  100   270

In [59]:
df=pd.read_excel('sample1.xlsx')  # 책에 포함되는 코드는 아닙니다

In [60]:
df[[True, True, False, False]]

    이름  국어  수학   영어
0  홍길동  90  85   90
1  장희원  85  85  100

In [61]:
tf=df['영어']>=90

In [62]:
tf

0     True
1     True
2    False
3    False
Name: 영어, dtype: bool

In [63]:
df[df['영어']>=90]

    이름  국어  수학   영어
0  홍길동  90  85   90
1  장희원  85  85  100

In [64]:
df=pd.read_excel('sample4.xlsx')   # 책에 포함되는 코드는 아닙니다

In [65]:
df

    이름  평가  국어  수학   영어
0  홍길동  중간  90  85   90
1  홍길동  기말  95  83   95
2  장희원  중간  85  85  100
3  장희원  기말  90  87  100
4  김보라  중간  80  80   75
5  김보라  기말  82  85   77
6  최하늘  중간  90  80   85
7  최하늘  기말  85  90   83

In [66]:
df.groupby('평가').mean()

       국어     수학     영어
평가
기말  88.00  86.25  88.75
중간  86.25  82.50  87.50

In [67]:
df.groupby('평가')

In [68]:
g=df.groupby('평가')

In [69]:
g.groups

{'기말': [1, 3, 5, 7], '중간': [0, 2, 4, 6]}

In [70]:
g.size()

평가
기말    4
중간    4
dtype: int64

In [71]:
df1=g.get_group('기말')

In [72]:
df1

    이름  평가  국어  수학   영어
1  홍길동  기말  95  83   95
3  장희원  기말  90  87  100
5  김보라  기말  82  85   77
7  최하늘  기말  85  90   83

In [73]:
g.mean()

       국어     수학     영어
평가
기말  88.00  86.25  88.75
중간  86.25  82.50  87.50

In [74]:
df1=df.pivot(index='이름', columns='평가', values='국어')

In [75]:
df1

평가   기말  중간
이름
김보라  82  80
장희원  90  85
최하늘  85  90
홍길동  95  90

In [76]:
df=pd.read_excel('sample5.xlsx')  # 책에 포함되는 코드는 아닙니다

In [77]:
df.pivot(index=['이름', '학년'], columns='평가', values='국어')

평가        기말    중간
이름  학년
김보라 1   82.0  80.0
장희원 1   90.0  85.0
최하늘 1   85.0  90.0
홍길동 1   95.0  90.0
    2    NaN  85.0

In [78]:
df.pivot_table(index='이름', columns='평가', values='국어')

평가     기말    중간
이름
김보라  82.0  80.0
장희원  90.0  85.0
최하늘  85.0  90.0
홍길동  95.0  87.5